tomyqg/STM32_RTT_F107/components/DeviceDrivers/usart5.c
						//报文接收完毕
						//进行完毕的相应操作
						//将采集成功的数据复制到成功数组
						memset(WIFI_RecvSocketCData,0x00,USART_REC_LEN);
						memcpy(WIFI_RecvSocketCData,&USART_RX_BUF[9],(PackLen-9));
						//解析数据，去掉多包问题
						WIFI_Recv_SocketC_LEN = PackLen-9;
						
						WIFI_RecvSocketCData[WIFI_Recv_SocketC_LEN] = '\0';
						WIFI_Recv_SocketC_Event = 1;
						//SEGGER_RTT_printf(0, "WIFI_RecvData :%s\n",WIFI_RecvSocketCData);
						eTypeMachine = EN_RECV_TYPE_UNKNOWN;
						eStateMachine = EN_RECV_ST_GET_SCOKET_HEAD;
						Cur = 0;
						pos = 0;		
						TIM3_Int_Deinit();
						break;
				}
								
				pos++;
			}
		}	
}

void clear_WIFI(void)
{
	//TIM3_Int_Deinit();
	eStateMachine = EN_RECV_ST_GET_SCOKET_HEAD;
	Cur = 0;
}

#ifdef USR_MODULE
//进入AT模式
int AT(void)
{
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//先向模块写入"+++"然后再写入"a" 写入+++返回"a" 写入"a"返回+ok
	WIFI_SendData("+++", 3);
	//获取到a
	rt_hw_ms_delay(350);
	if(Cur < 1)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(USART_RX_BUF,"a",1))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}
	}
	
	//接着发送a
	clear_WIFI();
	WIFI_SendData("a", 1);
	rt_hw_ms_delay(350);
	if(Cur < 3)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(USART_RX_BUF,"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}

	}
	printf("AT :a+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
}


//切换回原来的工作模式    OK
int AT_ENTM(void)
{
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//发送"AT+ENTM\n",返回+ok
	WIFI_SendData("AT+ENTM\n", 8);
	rt_hw_ms_delay(300);
	if(Cur < 10)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[9],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}

	}
	printf("AT+ENTM :+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
	
}

//usr 版本信息
int AT_VER(void)
{
	int i = 0,flag_failed = 0;
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	WIFI_SendData("AT+VER\n", 7);

	for(i = 0;i< 400;i++)
	{
		delayMS(5);
		if(Cur >= 10) 
		{
			flag_failed = 1;
			break;
		}
		
	}
	
	if(flag_failed == 0)
	{
		rt_mutex_release(wifi_uart_lock);
		clear_WIFI();
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[7],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			print2msg(ECU_DBG_WIFI,"Version",(char *)USART_RX_BUF);
			clear_WIFI();
			return 0;
		}
	}
	

	printmsg(ECU_DBG_WIFI,"AT_VER WIFI Get reply time out 1");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return -1;

}


int AT_Z(void)
{
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//发送"AT+Z\n",返回+ok
	WIFI_SendData("AT+Z\n", 5);
	rt_hw_ms_delay(300);
	if(Cur < 6)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[6],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}

	}
	printf("AT+Z :+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
	
}

//设置WIFI SSID

int AT_WAP(char *ECUID12)
{
	char AT[100] = { '\0' };
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//发送"AT+WAKEY\n",返回+ok
	sprintf(AT,"AT+WAP=11BGN,ECU_R_%s,Auto\n",ECUID12);
	printf("%s",AT);
	WIFI_SendData(AT, (strlen(AT)+1));
	
	rt_hw_ms_delay(1000);
	
	if(Cur < 10)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[strlen(AT)+1],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}
	}
	printf("AT+WAP :+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
}

//设置WIFI密码
int AT_WAKEY(char *NewPasswd)
{
	char AT[100] = { '\0' };
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//发送"AT+WAKEY\n",返回+ok
	sprintf(AT,"AT+WAKEY=WPA2PSK,AES,%s\n",NewPasswd);
	printf("%s",AT);
	WIFI_SendData(AT, (strlen(AT)+1));
	
	rt_hw_ms_delay(1000);
	
	if(Cur < 10)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[strlen(AT)+1],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}
	}
	printf("AT+WAKEY :+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
}
/*  废除
//设置连接无线路由器SSID
int AT_WSSSID(char *SSSID)
{
	int i = 0,flag_failed = 0;
	char AT[100] = { '\0' };
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//发送"AT+WSSSID\n",返回+ok
	sprintf(AT,"AT+WSSSID=%s\n",SSSID);
	printf("%s\n",AT);
	WIFI_SendData(AT, (strlen(AT)+1));
	delayMS(5);
	for(i = 0;i< 400;i++)
	{
		delayMS(5);
		if(Cur >= (strlen(AT)+ 4)) 
		{
			flag_failed = 1;
			break;
		}
		
	}
	
	if(flag_failed == 0)
	{
		rt_mutex_release(wifi_uart_lock);
		return -1;
	}else
	{
		if(memcmp(&USART_RX_BUF[strlen(AT)+1],"+ok",3))
		{
			rt_mutex_release(wifi_uart_lock);
			return -1;
		}
	}
	printf("AT+WSSSID :+ok\n");
	clear_WIFI();
	rt_mutex_release(wifi_uart_lock);
	return 0;
}

//设置连接路由器KEY
int AT_WSKEY(char Auth,char Encry,char *SKEY,int passWDLen)
{
	int i = 0,flag_failed = 0;
	char AT[100] = { '\0' };
	char AuthString[20] = {'\0'};
	char EncryString[20] = {'\0'};
	int AT_length = 0;
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	clear_WIFI();

	if(Auth == '1')
	{
		sprintf(AuthString,"OPEN");
	}else if(Auth == '2')
	{
		sprintf(AuthString,"SHARED");
	}else if(Auth == '3')
	{
		sprintf(AuthString,"WPAPSK");
	}else if(Auth == '4')
	{
		sprintf(AuthString,"WPA2PSK");
	}

	if(Encry == '1')
	{
		sprintf(EncryString,"NONE");
	}else if(Encry == '2')
	{
		sprintf(EncryString,"WEP-H");
	}else if(Encry == '3')
	{	
		sprintf(EncryString,"WEP-A");
	}else if(Encry == '4')
	{
		sprintf(EncryString,"TKIP");
	}else if(Encry == '5')
	{
		sprintf(EncryString,"AES");
	}
	
	//发送"AT+WSSSID\n",返回+ok
	if(passWDLen > 0)
	{
		//密码长度大于0
		
		sprintf(AT,"AT+WSKEY=%s,%s,",AuthString,EncryString);
		AT_length = strlen(AT);
		memcpy(&AT[AT_length],SKEY,passWDLen);
		AT[AT_length+passWDLen]  = '\n';
		AT_length = AT_length+passWDLen + 1;
		
	}else
	{
		//密码长度为0
		sprintf(AT,"AT+WSKEY=%s,%s\n",AuthString,EncryString);
		AT_length = strlen(AT);
	}
	
	printf("%s\n",AT);
	WIFI_SendData(AT, (AT_length+1));
	
	for(i = 0;i< 400;i++)
	{
		delayMS(5);
		if(Cur >= (AT_length+4)) 
		{
			flag_failed = 1;
			break;
		}
		
