tomyqg/STM32_RTT_F107/components/DeviceDrivers/usart5.c
	//配置SOCKET C  IP地址
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPADDC("192.168.1.100"))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	//配置SOCKET C端口
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPPTC(CONTROL_SERVER_PORT1))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	for(i = 0;i<3;i++)
	{
		if(0 == AT_ENTM())
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	printf("WIFI_InitTestMode Over\n");
	return 0;


}

int InitWorkMode(void)
{
	int i = 0,res = 0;
	//进入AT模式
	for(i = 0;i<3;i++)
	{
		if(0 == AT())
		{//进入AT成功
			//printf("AT Successful\n");
			res = 0;
			break;
		}else
		{//进入AT失败,尝试退出AT模式
			//printf("AT Failed,AT_ENTM\n");
			res = -1;
			AT_ENTM();
		}
	}
	if(res == -1) return -1;
	//进入AT模式成功后，执行后续操作

	//选择 WMODE
	for(i = 0;i<3;i++)
	{
		if(0 == AT_WMODE("STA"))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;	

	//配置SOCKET B IP地址
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPADDB(CLIENT_SERVER_IP))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET B端口
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPPTB(CLIENT_SERVER_PORT1))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET C  IP地址
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPADDC(CLIENT_SERVER_IP))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	//配置SOCKET C端口
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPPTC(CONTROL_SERVER_PORT1))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	for(i = 0;i<3;i++)
	{
		if(0 == AT_ENTM())
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	printf("WIFI_InitWorkMode Over\n");

	return 0;
}



int WIFI_ChangePasswd(char *NewPasswd)
{
	int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	rt_hw_ms_delay(200);
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_WAKEY(NewPasswd);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			rt_hw_ms_delay(200);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}		
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_ENTM();;
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();

	return 0;
}


int WIFI_Reset(void)
{
	GPIO_ResetBits(WIFI_GPIO, WIFI_PIN);
	
	rt_hw_ms_delay(1000);
	GPIO_SetBits(WIFI_GPIO, WIFI_PIN);
	return 0;

}

int WIFI_SoftReset(void)
{
	int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			rt_hw_ms_delay(200);
			ret =AT_ENTM();
			if(ret == 0) break;
		}
	
		return -1;
	}	
	
	rt_hw_ms_delay(200);	
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_ENTM();;
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();
	return 0;
}

int WIFI_Test(void)
{
	int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			rt_hw_ms_delay(200);
			ret =AT_ENTM();
			if(ret == 0)return 0;
		}
	
		return -1;
	}	
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_ENTM();
		if(ret == 0) return 0;
	}
	return -1;

}


int WIFI_Factory(char *ECUID12)
{
	int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(500);
		ret = AT();
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			rt_hw_ms_delay(200);
			ret =AT_ENTM();
			if(ret == 0) break;
		}
	
		return -1;
	}	
	
	rt_hw_ms_delay(200);
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret = AT_WAP(ECUID12);
		ret = AT_WAKEY("88888888");
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			rt_hw_ms_delay(200);
			ret =AT_ENTM();
			if(ret == 0) break;
		}
	
		return -1;
	}		
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		rt_hw_ms_delay(200);
		ret =AT_ENTM();;
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();	
	return 0;

}


#endif 



//创建SOCKET连接
//返回0 表示创建成功  -1表示创建失败
int WIFI_Create(eSocketType Type)
{
	char send[50] = {'\0'};
	int i = 0,j = 0;
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x01;
	send[4]= 0x00;
	send[5]= 0x02;
	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_Recv_Socket_Event = 0;
		WIFI_SendData(send, 6);
		
		for(j = 0;j <300;j++)
		{
			if(WIFI_Recv_Socket_Event == 1)
			{
				WIFI_Recv_Socket_Event = 0;
				if((WIFI_RecvSocketData[0] == 0x65)&&
					(WIFI_RecvSocketData[1] == send[1])&&
					(WIFI_RecvSocketData[2] == 0x06)&&
					(WIFI_RecvSocketData[4] == 0x01))
				{
					//创建 SOCKET 成功
					printdecmsg(ECU_DBG_WIFI,"WIFI_CreateSocket Successful ",Type);
					clear_WIFI();
					return 0;
				}else
				{
					//创建SOCKET 失败
					printdecmsg(ECU_DBG_WIFI,"WIFI_CreateSocket Failed ",Type);
					clear_WIFI();
					return -1;
				}
			}
					
					
				rt_thread_delay(1);
		}
		printdecmsg(ECU_DBG_WIFI,"WIFI_CreateSocket WIFI Get reply time out ",Type);
	}	
	clear_WIFI();
	return -1;
}

//关闭Socket连接
//返回0 关闭socket连接成功  -1关闭socket连接失败
int WIFI_Close(eSocketType Type)
{
	char send[50] = {'\0'};
	int i = 0,j = 0;
	if(1 != WIFI_QueryStatus(Type))
		return -1;

	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x02;
	send[4]= 0x00;
	send[5]= 0x03;
	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_Recv_Socket_Event = 0;
		WIFI_SendData(send, 6);
		for(j = 0;j <300;j++)
		{
			if(WIFI_Recv_Socket_Event == 1)
			{
				WIFI_Recv_Socket_Event = 0;
				if((WIFI_RecvSocketData[0] == 0x65)&&
					(WIFI_RecvSocketData[1] == send[1])&&
					(WIFI_RecvSocketData[2] == 0x06)&&
					(WIFI_RecvSocketData[4] == 0x01))
				{
					//关闭SOCKET 成功
					printdecmsg(ECU_DBG_WIFI,"WIFI_CloseSocket Successful ",Type);
					clear_WIFI();
					return 0;
				}else
				{
					//关闭SOCKET 失败
					printdecmsg(ECU_DBG_WIFI,"WIFI_CloseSocket Failed ",Type);
					clear_WIFI();
					return -1;
				}
				
