tomyqg/STM32_RTT_F107/components/DeviceDrivers/usart5.c
			}
			rt_thread_delay(1);
		}
		printdecmsg(ECU_DBG_WIFI,"WIFI_CloseSocket WIFI Get reply time out ",Type);
	}	
	clear_WIFI();
	return -1;

}


int WIFI_QueryStatus(eSocketType Type)
{
	char send[50] = {'\0'};
	int i = 0,j = 0;
	clear_WIFI();
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x03;
	send[4]= 0x00;
	send[5]= 0x04;

	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_Recv_Socket_Event = 0;
		WIFI_SendData(send, 6);
		for(j = 0;j <300;j++)
		{
			if(WIFI_Recv_Socket_Event == 1)
			{
				WIFI_Recv_Socket_Event = 0;
				if((WIFI_RecvSocketData[0] == 0x65)&&
					(WIFI_RecvSocketData[1] == send[1])&&
					(WIFI_RecvSocketData[2] == 0x06))
				{
#ifdef USR_MODULE					
					//查询SOCKET 成功
					if(WIFI_RecvSocketData[4] == 0x01)	//在线
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus Online ",Type);
						clear_WIFI();
						return 1;
					}else if(WIFI_RecvSocketData[4] == 0x00)	//离线
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus not Online ",Type);
						clear_WIFI();
						return 0;
					}else	//未知
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus unknown ",Type);
						clear_WIFI();
						return -1;
					}
#endif
#ifdef RAK475_MODULE
					//查询SOCKET 成功
					if(WIFI_RecvSocketData[4] == 0x01)			//离线
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus Online ",Type);
						clear_WIFI();
						return 0;
					}else if(WIFI_RecvSocketData[4] == 0x00)	//在线
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus not Online ",Type);
						clear_WIFI();
						return 1;
					}else	//未知
					{
						printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus unknown ",Type);
						clear_WIFI();
						return -1;
					}
#endif		
				}else
				{
					//查询SOCKET 失败
					printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus Failed ",Type);
					clear_WIFI();
					return -1;
				}
				
			}
			rt_thread_delay(1);
		}
		printdecmsg(ECU_DBG_WIFI,"WIFI_QueryStatus WIFI Get reply time out ",Type);
	}	
	clear_WIFI();
	return -1;
}

char sendbuff[4096] = {'\0'};

//SOCKET A 发送数据  \n需要在传入字符串中带入
int SendToSocketA(char *data ,int length,unsigned char ID[8])
{
	int send_length = 0;	//需要发送的字节位置
	
	while(length > 0)
	{
		memset(sendbuff,'\0',4096);
		sprintf(sendbuff,"a%c%c%c%c%c%c%c%c",ID[0],ID[1],ID[2],ID[3],ID[4],ID[5],ID[6],ID[7]);

		if(length > SIZE_PER_SEND)
		{
			memcpy(&sendbuff[9],&data[send_length],SIZE_PER_SEND);
			WIFI_SendData(sendbuff, (SIZE_PER_SEND+9));
			send_length += SIZE_PER_SEND;
			length -= SIZE_PER_SEND;
		}else
		{
			memcpy(&sendbuff[9],&data[send_length],length);	
			WIFI_SendData(sendbuff, (length+9));
			length -= length;
			return 0;
		}
		rt_hw_ms_delay(200);
	}
	
	return 0;
}

//SOCKET B 发送数据
int SendToSocketB(char *data ,int length)
{
	//每次最多发送4000个字节
	int send_length = 0;	//需要发送的字节位置
	clear_WIFI();
	rt_mutex_take(usr_wifi_lock, RT_WAITING_FOREVER);
	//if((1 == WIFI_QueryStatus(SOCKET_B)) || (0 == WIFI_Create(SOCKET_B)))
	if(1 == WIFI_QueryStatus(SOCKET_B))
	{
		WIFI_Close(SOCKET_B);
	}

	if((0 == WIFI_Create(SOCKET_B)))
	{
		while(length > 0)
		{
			memset(sendbuff,0x00,4096);
			sprintf(sendbuff,"b00000000");
			//printf("length:%d  send_length:%d\n",length,send_length);
			if(length > SIZE_PER_SEND)
			{
				memcpy(&sendbuff[9],&data[send_length],SIZE_PER_SEND);
				
				WIFI_SendData(sendbuff, (SIZE_PER_SEND+9));
				send_length += SIZE_PER_SEND;
				length -= SIZE_PER_SEND;
			}else
			{	
				showconnected();
				writeconnecttime();
				memcpy(&sendbuff[9],&data[send_length],length);
				
				
				WIFI_SendData(sendbuff, (length+9));
				length -= length;
				rt_mutex_release(usr_wifi_lock);
				return 0;
			}
			
			rt_hw_ms_delay(300);
		}
		
	
	}else
	{
		showdisconnected();
	}
	rt_mutex_release(usr_wifi_lock);
	return -1;
}

//SOCKET C 发送数据
int SendToSocketC(char *data ,int length)
{
	//每次最多发送4000个字节
	int send_length = 0;
	char msg_length[6] = {'\0'};

	if(data[strlen(data)-1] == '\n'){
		sprintf(msg_length, "%05d", strlen(data)-1);
	}
	else{
		sprintf(msg_length, "%05d", strlen(data));
		strcat(data, "\n");
		length++;
	}
	strncpy(&data[5], msg_length, 5);
	clear_WIFI();
	rt_mutex_take(usr_wifi_lock, RT_WAITING_FOREVER);
	print2msg(ECU_DBG_CONTROL_CLIENT,"Sent", data);
	//if((1 == WIFI_QueryStatus(SOCKET_C)) || (0 == WIFI_Create(SOCKET_C)))
	if(1 == WIFI_QueryStatus(SOCKET_C))
	{
		WIFI_Close(SOCKET_C);
	}
	
	if((0 == WIFI_Create(SOCKET_C)))
	{
		while(length > 0)
		{
			memset(sendbuff,0x00,4096);
			sprintf(sendbuff,"c00000000");
			//printf("length:%d  send_length:%d\n",length,send_length);
			if(length > SIZE_PER_SEND)
			{
				memcpy(&sendbuff[9],&data[send_length],SIZE_PER_SEND);
				
				WIFI_SendData(sendbuff, (SIZE_PER_SEND+9));
				send_length += SIZE_PER_SEND;
				length -= SIZE_PER_SEND;
			}else
			{	
				memcpy(&sendbuff[9],&data[send_length],length);
			
				WIFI_SendData(sendbuff, (length+9));
				length -= length;
				rt_mutex_release(usr_wifi_lock);
				return 0;
			}
			
			rt_hw_ms_delay(300);
		}
		
	}
	rt_mutex_release(usr_wifi_lock);
	return -1;
}


int TestSocketCConnect(void)
{
	rt_mutex_take(usr_wifi_lock, RT_WAITING_FOREVER);
	if(1 == WIFI_QueryStatus(SOCKET_C))
	{
		WIFI_Close(SOCKET_C);
	}
	
	if((0 == WIFI_Create(SOCKET_C)))
	{
		rt_mutex_release(usr_wifi_lock);
		return 0;
	}else{
		rt_mutex_release(usr_wifi_lock);
		return -1;
	}
	

}

/*
int WIFI_ChangeSSID(char *SSID,char Auth,char Encry,char *Passwd,int passWDLen)
{
		int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	delayMS(5);
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSSSID(SSID);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSKEY(Auth,Encry,Passwd,passWDLen);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_ENTM();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();	
	return 0;
}

int WIFI_ConStatus(void)
{
	int status = 0;
	status = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8); 
	printf("status : %d\n",status);
	return status;
}
*/

#ifdef RT_USING_FINSH
#include <finsh.h>

FINSH_FUNCTION_EXPORT(AT , Into AT Mode.)
FINSH_FUNCTION_EXPORT(AT_ENTM , Into AT_ENTM Mode.)
FINSH_FUNCTION_EXPORT(AT_VER , Get version.)
FINSH_FUNCTION_EXPORT(AT_Z , Reset USR232.)

FINSH_FUNCTION_EXPORT(AT_WAP , Set WAP.)
FINSH_FUNCTION_EXPORT(AT_WAKEY , Set WAKEY.)
FINSH_FUNCTION_EXPORT(AT_WAKEY_Clear , Clear WAKEY.)

FINSH_FUNCTION_EXPORT(AT_TCPB_ON , Set TCP B ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDB , Set TCP B ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTB , Set TCP B PORT.)
FINSH_FUNCTION_EXPORT(AT_TCPC_ON , Set TCP C ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDC , Set TCP C ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTC , Set TCP C PORT.)

FINSH_FUNCTION_EXPORT(AT_FAPSTA_ON , Set FAPSTA ON.)
FINSH_FUNCTION_EXPORT(AT_WMODE , Set WMode AP or STA.)



FINSH_FUNCTION_EXPORT(InitWorkMode , Init Work Mode.)
FINSH_FUNCTION_EXPORT(InitTestMode , Init Test Mode.)

FINSH_FUNCTION_EXPORT(WIFI_Factory , Set WIFI ID .)
FINSH_FUNCTION_EXPORT(WIFI_Reset , Reset WIFI Module .)

FINSH_FUNCTION_EXPORT(SendToSocketB , Send SOCKET B.)
FINSH_FUNCTION_EXPORT(SendToSocketC , Send SOCKET C.)

#endif


